# 인덱싱 / 슬라이싱

# 인덱싱
a = [1, 2, 3, 4, 5]
print(a[0])
print(a[-1]) # 마지막 요소
print(a[-2]) # 뒤에서 두 번째 요소

b = [1, 2, 3, [10, 20]]
# 10 출력
print(b[-1][0])

c = [1, 2, 3, [10,20], 4, 5]
# 20 출력
print(c[3][1])

# a, b, c 3개의 리스트를 하나의 리스트로 합치기
all_list = [a, b, c]
print(all_list)

# a의 3 출력
print(all_list[0][2])
# c의 10 출력
print(all_list[2][3][0])

# 리스트 내용 변경
a = [1,2,3,4,5]

a[2] = 30
print(a) # [1, 2, 30, 4, 5]

# [start, end] : start ~ end-1까지
a[1:3] = [10, 20] # 인덱스 1~2의 값을 변경(저장 : 덮어씀)
print(a) # [1, 10, 20, 4, 5]

# 리스트 저장 : 하위 리스트로 생성
a[0] = [100,200,300]
print(a) # [[100, 200, 300], 10, 20, 4, 5]

a[1:3] = [] # 인덱스 1~2에 빈값으로 저장되면서 원소 삭제됨
print(a) # [[100, 200, 300], 4, 5]